In [15]:
##modu≈Ç 8.1 WPROWADZENIE DO PANDAS
import pandas as pd
import numpy as np

exam1=[89,85,93,83]
labels=["Student A", "Student B", "Student C", "Student D"]
pd.Series(exam1, labels)

Student A    89
Student B    85
Student C    93
Student D    83
dtype: int64

In [3]:
pd.Series(exam1, labels)["Student D"]

83

In [4]:
d={s:p for s,p in zip(labels, exam1)}
d

{'Student A': 89, 'Student B': 85, 'Student C': 93, 'Student D': 83}

In [5]:
pd.Series(d)

Student A    89
Student B    85
Student C    93
Student D    83
dtype: int64

In [9]:
exam2=[74,56,44,92]
e1=pd.Series(exam1,labels)
e2=pd.Series(exam2, labels)
e1
e2

Student A    74
Student B    56
Student C    44
Student D    92
dtype: int64

In [10]:
e1+e2

Student A    163
Student B    141
Student C    137
Student D    175
dtype: int64

In [ ]:
DATAFRAME

In [11]:
df=pd.DataFrame({"e1":exam1, 'e2':exam2}, index=labels)
df

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [12]:
df["e1"]

Student A    89
Student B    85
Student C    93
Student D    83
Name: e1, dtype: int64

In [14]:
type(df["e1"])

pandas.core.series.Series

In [16]:
data=np.array([exam1,exam2])
data.transpose()

array([[89, 74],
       [85, 56],
       [93, 44],
       [83, 92]])

In [17]:
df=pd.DataFrame(data.transpose(), index=labels, columns=['e1','e2'])
df

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [18]:
df.to_numpy()

array([[89, 74],
       [85, 56],
       [93, 44],
       [83, 92]])

In [19]:
df.shape

(4, 2)

In [20]:
df['e3']=[67,59,79,84]
df

           e1  e2  e3
Student A  89  74  67
Student B  85  56  59
Student C  93  44  79
Student D  83  92  84

In [22]:
df["semester_1"]=df["e1"]+df["e2"]+df["e3"]
df

           e1  e2  e3  semester_1
Student A  89  74  67         230
Student B  85  56  59         200
Student C  93  44  79         216
Student D  83  92  84         259

In [23]:
df[["e1","e2"]]

           e1  e2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [24]:
df.loc['Student C']

e1             93
e2             44
e3             79
semester_1    216
Name: Student C, dtype: int64

In [26]:
df.loc['Student C', 'e2']

44

In [27]:
df.loc[['Student C', 'Student D'], 'e2']

Student C    44
Student D    92
Name: e2, dtype: int32

In [28]:
df.iloc[3]

e1             83
e2             92
e3             84
semester_1    259
Name: Student D, dtype: int64

In [29]:
df.iloc[:1,:-1]

           e1  e2  e3
Student A  89  74  67

In [ ]:
MASKING

In [30]:
df['e2']>70

Student A     True
Student B    False
Student C    False
Student D     True
Name: e2, dtype: bool

In [31]:
df[df['e2']>70]

           e1  e2  e3  semester_1
Student A  89  74  67         230
Student D  83  92  84         259

In [35]:
df[(df['e2']<50) | (df['e2']>90)]

           e1  e2  e3  semester_1
Student C  93  44  79         216
Student D  83  92  84         259

In [36]:
df[(df['e2']<50) | (df['e1']>90)]

           e1  e2  e3  semester_1
Student C  93  44  79         216

In [ ]:
PODSTAWOWE OPERACJE

In [37]:
df.drop('semester_1', axis=1)

           e1  e2  e3
Student A  89  74  67
Student B  85  56  59
Student C  93  44  79
Student D  83  92  84

In [38]:
df

           e1  e2  e3  semester_1
Student A  89  74  67         230
Student B  85  56  59         200
Student C  93  44  79         216
Student D  83  92  84         259

In [40]:
df.drop(['e3','semester_1'], axis=1, inplace=True)

In [41]:
df.reset_index()

       index  e1  e2
0  Student A  89  74
1  Student B  85  56
2  Student C  93  44
3  Student D  83  92

In [42]:
df_newindex=df.reset_index()
df_newindex

       index  e1  e2
0  Student A  89  74
1  Student B  85  56
2  Student C  93  44
3  Student D  83  92

In [44]:
df_newindex['student_name']=['Adrian', 'Bart≈Çomiej', 'Celina', 'Dagmara']
df_newindex

       index  e1  e2 student_name
0  Student A  89  74       Adrian
1  Student B  85  56   Bart≈Çomiej
2  Student C  93  44       Celina
3  Student D  83  92      Dagmara

In [46]:
df_newindex.set_index('student_name')

                  index  e1  e2
student_name
Adrian        Student A  89  74
Bart≈Çomiej    Student B  85  56
Celina        Student C  93  44
Dagmara       Student D  83  92

In [51]:
df_newindex2=df.reset_index()
df_newindex2.index=['Artur', 'Bo≈ºenka', 'Cyryl', 'Danka']
df_newindex2

             index  e1  e2
Artur    Student A  89  74
Bo≈ºenka  Student B  85  56
Cyryl    Student C  93  44
Danka    Student D  83  92

In [54]:
df.rename(columns={'e1':'exam1', 'e2':'exam2'})

           exam1  exam2
Student A     89     74
Student B     85     56
Student C     93     44
Student D     83     92

In [55]:
df.rename(str.upper, axis='columns')

           E1  E2
Student A  89  74
Student B  85  56
Student C  93  44
Student D  83  92

In [ ]:
Unique, value_counts, sort_values, drop_duplicates

In [58]:
ddf=pd.DataFrame({'A':[100,44,56,99,85,100], 'B':['Panda', 'Snake', 'Snake', 'Rat', 'Dog', 'Panda']})
ddf

     A      B
0  100  Panda
1   44  Snake
2   56  Snake
3   99    Rat
4   85    Dog
5  100  Panda

In [61]:
ddf['B'].unique()

array(['Panda', 'Snake', 'Rat', 'Dog'], dtype=object)

In [62]:
ddf['B'].nunique()

4

In [63]:
ddf['B'].value_counts()

B
Panda    2
Snake    2
Rat      1
Dog      1
Name: count, dtype: int64

In [64]:
ddf['B'].value_counts(normalize=True)

B
Panda    0.333333
Snake    0.333333
Rat      0.166667
Dog      0.166667
Name: proportion, dtype: float64

In [65]:
ddf.sort_values(by='A', ascending=False)

     A      B
0  100  Panda
5  100  Panda
3   99    Rat
4   85    Dog
2   56  Snake
1   44  Snake

In [66]:
ddf.sort_values(by='A', ascending=True)

     A      B
1   44  Snake
2   56  Snake
4   85    Dog
3   99    Rat
0  100  Panda
5  100  Panda

In [67]:
ddf.drop_duplicates()

     A      B
0  100  Panda
1   44  Snake
2   56  Snake
3   99    Rat
4   85    Dog

In [ ]:
df1